#### terraform plan every: baa5bc9
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.lambda-sample.aws_api_gateway_resource.proxy: Refreshing state... [id=6pb4us]
module.lambda-sample.aws_api_gateway_rest_api.discord_endpoint: Refreshing state... [id=9kj5r3gk4m]
module.lambda-sample.aws_iam_role.lambda_iam_role: Refreshing state... [id=lambda_sample_python_iam_role]
module.lambda-sample.aws_api_gateway_method.proxy: Refreshing state... [id=agm-9kj5r3gk4m-6pb4us-ANY]
module.lambda-sample.aws_lambda_layer_version.lambda_layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:554506578892:layer:lambda_sample_python_lambda_layer:1]
module.lambda-sample.aws_api_gateway_integration.lambda: Refreshing state... [id=agi-9kj5r3gk4m-6pb4us-ANY]
module.lambda-sample.aws_iam_role_policy.lambda_access_policy: Refreshing state... [id=lambda_sample_python_iam_role:lambda_sample_python_lambda_access_policy]
module.lambda-sample.aws_lambda_function.lambda_function: Refreshing state... [id=lambda_sample_python_function]
module.lambda-sample.aws_api_gateway_deployment.example: Refreshing state... [id=i0cwq8]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.lambda-sample.aws_api_gateway_api_key.example will be created
  + resource "aws_api_gateway_api_key" "example" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + description       = "Managed by Terraform"
      + enabled           = true
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + name              = "example_api_key"
      + tags_all          = (known after apply)
      + value             = (sensitive value)
    }

  # module.lambda-sample.aws_api_gateway_deployment.example must be replaced
+/- resource "aws_api_gateway_deployment" "example" {
      ~ created_date      = "2021-05-12T06:05:14Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:ap-northeast-1:554506578892:9kj5r3gk4m/test" -> (known after apply)
      ~ id                = "i0cwq8" -> (known after apply)
      ~ invoke_url        = "https://9kj5r3gk4m.execute-api.ap-northeast-1.amazonaws.com/test" -> (known after apply)
      + stage_description = (known after apply) # forces replacement
      ~ stage_name        = "test" -> "example" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.lambda-sample.aws_api_gateway_integration.hello_world will be created
  + resource "aws_api_gateway_integration" "hello_world" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "9kj5r3gk4m"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:554506578892:function:lambda_sample_python_function/invocations"
    }

  # module.lambda-sample.aws_api_gateway_integration.lambda will be destroyed
  - resource "aws_api_gateway_integration" "lambda" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "6pb4us" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "ANY" -> null
      - id                      = "agi-9kj5r3gk4m-6pb4us-ANY" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "6pb4us" -> null
      - rest_api_id             = "9kj5r3gk4m" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:554506578892:function:lambda_sample_python_function/invocations" -> null
    }

  # module.lambda-sample.aws_api_gateway_method.hello_world will be created
  + resource "aws_api_gateway_method" "hello_world" {
      + api_key_required = true
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "9kj5r3gk4m"
    }

  # module.lambda-sample.aws_api_gateway_method.proxy will be destroyed
  - resource "aws_api_gateway_method" "proxy" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "ANY" -> null
      - id                   = "agm-9kj5r3gk4m-6pb4us-ANY" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "6pb4us" -> null
      - rest_api_id          = "9kj5r3gk4m" -> null
    }

  # module.lambda-sample.aws_api_gateway_method_response.hello_world will be created
  + resource "aws_api_gateway_method_response" "hello_world" {
      + http_method     = "POST"
      + id              = (known after apply)
      + resource_id     = (known after apply)
      + response_models = {
          + "application/json" = "Empty"
        }
      + rest_api_id     = "9kj5r3gk4m"
      + status_code     = "200"
    }

  # module.lambda-sample.aws_api_gateway_method_settings.example will be created
  + resource "aws_api_gateway_method_settings" "example" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = "9kj5r3gk4m"
      + stage_name  = "example"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = true
          + logging_level                              = "INFO"
          + metrics_enabled                            = (known after apply)
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = -1
          + throttling_rate_limit                      = -1
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.lambda-sample.aws_api_gateway_resource.hello_world will be created
  + resource "aws_api_gateway_resource" "hello_world" {
      + id          = (known after apply)
      + parent_id   = "lyc0t47s94"
      + path        = (known after apply)
      + path_part   = "hello_world"
      + rest_api_id = "9kj5r3gk4m"
    }

  # module.lambda-sample.aws_api_gateway_resource.proxy will be destroyed
  - resource "aws_api_gateway_resource" "proxy" {
      - id          = "6pb4us" -> null
      - parent_id   = "lyc0t47s94" -> null
      - path        = "/{proxy+}" -> null
      - path_part   = "{proxy+}" -> null
      - rest_api_id = "9kj5r3gk4m" -> null
    }

  # module.lambda-sample.aws_api_gateway_usage_plan.example will be created
  + resource "aws_api_gateway_usage_plan" "example" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "example_usage_plan"
      + tags_all = (known after apply)

      + api_stages {
          + api_id = "9kj5r3gk4m"
          + stage  = "example"
        }
    }

  # module.lambda-sample.aws_api_gateway_usage_plan_key.example will be created
  + resource "aws_api_gateway_usage_plan_key" "example" {
      + id            = (known after apply)
      + key_id        = (known after apply)
      + key_type      = "API_KEY"
      + name          = (known after apply)
      + usage_plan_id = (known after apply)
      + value         = (known after apply)
    }

  # module.lambda-sample.aws_lambda_permission.hello_world will be created
  + resource "aws_lambda_permission" "hello_world" {
      + action        = "lambda:InvokeFunction"
      + function_name = "lambda_sample_python_function"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = "arn:aws:execute-api:ap-northeast-1:554506578892:9kj5r3gk4m/*/POST/hello_world"
      + statement_id  = (known after apply)
    }

Plan: 10 to add, 0 to change, 4 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "cert_arn" but a value was
found in file "dev.auto.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>




*Pusher: @lazmond3, Action: `pull_request`*